; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-66)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b18)
    (on b18 b9)
    (on b9 b17)
    (on b17 b10)
    (on b10 b5)
    (on b5 b15)
    (on b15 b11)
    (on b11 b1)
    (on b1 b13)
    (on b13 b2)
    (on b2 b7)
    (on b7 b14)
    (on b14 b20)
    (on-table b20)
    (clear b6)
    (on b6 b3)
    (on b3 b4)
    (on b4 b12)
    (on b12 b19)
    (on b19 b16)
    (on-table b16))
 (:goal (and 
(on-table b17)
))
)

; plan
1. (unstack b8 b18)
   deleted: (on b8 b18) (clear b8) (arm-empty)
   added: (holding b8) (clear b18)
   goals met: 0 of 1
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
3. (unstack b18 b9)
   deleted: (on b18 b9) (clear b18) (arm-empty)
   added: (holding b18) (clear b9)
   goals met: 0 of 1
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
5. (unstack b9 b17)
   deleted: (on b9 b17) (clear b9) (arm-empty)
   added: (holding b9) (clear b17)
   goals met: 0 of 1
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
7. (unstack b17 b10)
   deleted: (on b17 b10) (clear b17) (arm-empty)
   added: (holding b17) (clear b10)
   goals met: 0 of 1
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 1
